ws-server/src/main/resources/request_demo.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<TransactionID xmlns="http://www.monternet.com/dsmp/schemas/">0001156953663</TransactionID>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<SyncOrderRelationReq xmlns="http://www.monternet.com/dsmp/schemas/">
			<Version>1.5.0</Version>
			<MsgType>SyncOrderRelationReq</MsgType>
			<Send_Address><DeviceType>0</DeviceType><DeviceID>0001</DeviceID></Send_Address>
			<Dest_Address><DeviceType>400</DeviceType><DeviceID>0</DeviceID></Dest_Address>
			<FeeUser_ID><UserIDType>1</UserIDType><MSISDN>13681463548</MSISDN><PseudoCode></PseudoCode></FeeUser_ID>
			<DestUser_ID><UserIDType>1</UserIDType><MSISDN>13681463548</MSISDN><PseudoCode></PseudoCode></DestUser_ID>
			<LinkID></LinkID>
			<ActionID>1</ActionID>
			<ActionReasonID>1</ActionReasonID>
			<SPID>901254</SPID>
			<SPServiceID>-TDXSYB</SPServiceID>
			<AccessMode>3</AccessMode>
			<FeatureStr>MTA2NTgzMTQgLVREWFNZQg==</FeatureStr>
		</SyncOrderRelationReq>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>