workSpace/当前任务/湖南平台/hn_misc/src/bin/resources/order_msg.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Header>
		<TransactionID xmlns="http://www.monternet.com/dsmp/schemas/">00230025652122</TransactionID>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<SyncOrderRelationReq xmlns="http://www.monternet.com/dsmp/schemas/">
			<Version>1.5.0</Version>
			<MsgType>SyncOrderRelationReq</MsgType>
			<Send_Address>
				<DeviceType>0</DeviceType>
				<DeviceID>0023</DeviceID>
			</Send_Address>
			<Dest_Address>
				<DeviceType>400</DeviceType>
				<DeviceID>0</DeviceID>
			</Dest_Address>
			<FeeUser_ID>
				<UserIDType>1</UserIDType>
				<MSISDN>${phone}</MSISDN>
				<PseudoCode></PseudoCode>
			</FeeUser_ID>
			<DestUser_ID>
				<UserIDType>1</UserIDType>
				<MSISDN>${phone}</MSISDN>
				<PseudoCode></PseudoCode>
			</DestUser_ID>
			<LinkID>SP</LinkID>
			<ActionID>1</ActionID>
			<ActionReasonID>1</ActionReasonID>
			<SPID>918522</SPID>
			<SPServiceID>${service_id}</SPServiceID>
			<AccessMode>3</AccessMode>
			<FeatureStr>MTA2NTg1NjEgWXRh</FeatureStr>
		</SyncOrderRelationReq>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>